"Close" = "Đóng";

"Scan Card" = "Quét thẻ";

"Scan card" = "Quét thẻ";

"The IBAN you entered is invalid." = "IBAN quý vị đã nhập không hợp lệ.";

"There was an error processing your card -- try again in a few seconds" = "Có lỗi bất ngờ khi xử lý thẻ -- hãy thử lại sau vài giây";

"There was an unexpected error -- try again in a few seconds" = "Có lỗi bất ngờ -- hãy thử lại sau vài giây";

"Try again" = "Thử lại";

"We use Stripe to verify your card details. Stripe may use and store your data according its privacy policy. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Learn more</u></a>" = "Chúng tôi sử dụng Stripe để xác minh chi tiết thẻ của bạn. Stripe có thể sử dụng và lưu trữ dữ liệu của bạn theo chính sách quyền riêng tư của họ. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Tìm hiểu thêm</u></a>";

"Your card has expired" = "Thẻ đã hết hạn";

"Your card was declined" = "Thẻ bị từ chối";

"Your card's expiration month is invalid" = "Tháng hết hạn trên thẻ không hợp lệ";

"Your card's expiration year is invalid" = "Năm hết hạn trên thẻ không hợp lệ";

"Your card's number is invalid" = "Số thẻ không đúng";

"Your card's security code is invalid" = "Mã bảo mật của thẻ không đúng";

"Your name is invalid." = "Tên của quý vị không hợp lệ.";

"Your payment method was declined." = "Phương thức thanh toán của quý vị đã bị từ chối.";
